# inserting series into pandas

In [4]:
import pandas as pd
import numpy as np

In [2]:
dict1= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4,2]}
frame = pd.DataFrame(dict1)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.0

Let us have a new series represeantating debt

In [5]:
debtValues = pd.Series([200,300,600,100,900],index= np.arange(5))

In [6]:
frame['average debt'] = debtValues
frame

    state  year  pop  average debt
0    Ohio  2000  1.5           200
1    Ohio  2001  1.7           300
2    Ohio  2002  3.6           600
3  Nevada  2001  2.4           100
4  Nevada  2002  2.0           900

? what will happen if the index is incomplete or only certain index are present..It puts NaN

In [8]:
del frame['average debt'] # to remove a column..we can simply delete it like in dict
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.0

In [9]:
debtValues = pd.Series([200,300,600],index=[0,2,4])
frame['average debt'] = debtValues
frame

    state  year  pop  average debt
0    Ohio  2000  1.5         200.0
1    Ohio  2001  1.7           NaN
2    Ohio  2002  3.6         300.0
3  Nevada  2001  2.4           NaN
4  Nevada  2002  2.0         600.0

here we can see Nan appears

In [10]:
frame['average debt']>200 # returns a bool

0    False
1    False
2     True
3    False
4     True
Name: average debt, dtype: bool

# extracting columns and indexes

In [11]:
frame.columns

Index(['state', 'year', 'pop', 'average debt'], dtype='object')

In [14]:
frame.index

RangeIndex(start=0, stop=5, step=1)

# converting nested dicts to dataframe

In [15]:
nestedDict1 = {'Nevada': {2001: 2.4, 2002: 2.9},
                'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# it will interpret "Nevada" as columns and 2001 as indexes
#The keys in the inner dicts are unioned and sorted to form the index in the result

In [16]:
frame1 = pd.DataFrame(nestedDict1)

In [17]:
frame1

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

You can also transpose dataframe

In [18]:
frame1.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

# setting name for index and column

In [25]:
frame1.columns.name = 'state'
frame1.index.name = 'year'
frame1

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5